In [1]:
my_tup = (34, 56, 76)
print(my_tup)

(34, 56, 76)

In [5]:
print(*my_tup, sep=', ')

34, 56, 76

In [5]:
import pandas as pd
df = pd.read_csv('test.csv',sep = ' ', header = None)

In [6]:
df

       0   1     2       3      4
0  Hello  my  name      is  shyam
1      I   a  good  gentle    man

In [7]:
import requests

url = "http://api.geonames.org/findNearbyPOIsOSMJSON?lat=40.7128&lng=-74.0060&maxRows=50&radius=1&username=krishna99"

payload = {}
headers = {}

response = requests.request("GET", url, headers=headers, data=payload)

print(response.text)

{"poi":[{"lng":"-74.00603","distance":"0.01","name":"City Hall","typeClass":"amenity","typeName":"townhall","lat":"40.71274"},{"lng":"-74.0066","distance":"0.07","name":"IRT City Hall Loop","typeClass":"railway","typeName":"subway","lat":"40.71232"},{"lng":"-74.00638","distance":"0.08","name":"","typeClass":"amenity","typeName":"drinking_water","lat":"40.71342"},{"lng":"-74.00676","distance":"0.08","name":"City Hall Park","typeClass":"leisure","typeName":"park","lat":"40.71244"},{"lng":"-74.00507","distance":"0.08","name":"","typeClass":"amenity","typeName":"drinking_water","lat":"40.71279"},{"lng":"-74.00586","distance":"0.08","name":"IRT Lexington Avenue Line","typeClass":"railway","typeName":"subway","lat":"40.71209"},{"lng":"-74.00507","distance":"0.09","name":"Brooklyn Bridge-City Hall (4,5,6)","typeClass":"railway","typeName":"station","lat":"40.71235"},{"lng":"-74.00705","distance":"0.09","name":"","typeClass":"railway","typeName":"subway_entrance","lat":"40.7131"},{"lng":"-74.00677","distance":"0.1","name":"","typeClass":"railway","typeName":"subway_entrance","lat":"40.71344"},{"lng":"-74.00668","distance":"0.1","name":"","typeClass":"railway","typeName":"subway_entrance","lat":"40.71353"},{"lng":"-74.0069","distance":"0.1","name":"City Hall (R,W)","typeClass":"railway","typeName":"station","lat":"40.71338"},{"lng":"-74.0048","distance":"0.1","name":"","typeClass":"railway","typeName":"subway_entrance","lat":"40.71286"},{"lng":"-74.00728","distance":"0.11","name":"N.Y.C. Gifts & Stuff","typeClass":"shop","typeName":"gift","lat":"40.71283"},{"lng":"-74.00616","distance":"0.12","name":"Pace University Bookstore","typeClass":"shop","typeName":"books","lat":"40.71177"},{"lng":"-74.00709","distance":"0.12","name":"Strawberry","typeClass":"shop","typeName":"boutique","lat":"40.71344"},{"lng":"-74.00461","distance":"0.12","name":"Citi Bike - Centre St & Chambers St","typeClass":"amenity","typeName":"bicycle_rental","lat":"40.71273"},{"lng":"-74.00717","distance":"0.12","name":"Wilner Chemists","typeClass":"amenity","typeName":"pharmacy","lat":"40.71339"},{"lng":"-74.00715","distance":"0.12","name":"","typeClass":"natural","typeName":"water","lat":"40.71217"},{"lng":"-74.00715","distance":"0.12","name":"","typeClass":"amenity","typeName":"fountain","lat":"40.71216"},{"lng":"-74.00703","distance":"0.12","name":"","typeClass":"amenity","typeName":"drinking_water","lat":"40.71202"},{"lng":"-74.00705","distance":"0.13","name":"TD Bank","typeClass":"amenity","typeName":"bank","lat":"40.71361"},{"lng":"-74.00684","distance":"0.13","name":"Bank of America","typeClass":"amenity","typeName":"bank","lat":"40.71375"},{"lng":"-74.00748","distance":"0.13","name":"","typeClass":"amenity","typeName":"bank","lat":"40.71304"},{"lng":"-74.00649","distance":"0.13","name":"Optimo Cigars","typeClass":"shop","typeName":"convenience","lat":"40.71169"},{"lng":"-74.00669","distance":"0.14","name":"Starbucks","typeClass":"amenity","typeName":"cafe","lat":"40.71164"},{"lng":"-74.0059","distance":"0.14","name":"Denny's","typeClass":"amenity","typeName":"restaurant","lat":"40.71153"},{"lng":"-74.00732","distance":"0.15","name":"IND Eighth Avenue Line","typeClass":"railway","typeName":"subway","lat":"40.71189"},{"lng":"-74.0078","distance":"0.15","name":"Chambers Street â€“ World Trade Center / Park Place","typeClass":"railway","typeName":"subway","lat":"40.7127"},{"lng":"-74.00552","distance":"0.15","name":"Citi Bike - Spruce St & Nassau St","typeClass":"amenity","typeName":"bicycle_rental","lat":"40.71146"},{"lng":"-74.00603","distance":"0.16","name":"Duane Reade","typeClass":"amenity","typeName":"pharmacy","lat":"40.71421"},{"lng":"-74.00477","distance":"0.16","name":"","typeClass":"amenity","typeName":"parking","lat":"40.71387"},{"lng":"-74.0064","distance":"0.17","name":"","typeClass":"amenity","typeName":"telephone","lat":"40.71433"},{"lng":"-74.00651","distance":"0.18","name":"","typeClass":"amenity","typeName":"bicycle_parking","lat":"40.71434"},{"lng":"-74.00644","distance":"0.18","name":"","typeClass":"shop","typeName":"newsagent","lat":"40.71436"},{"lng":"-74.00635","distance":"0.18","name":"Capital One","typeClass":"amenity","typeName":"bank","lat":"40.71438"},{"lng":"-74.00683","distance":"0.18","name":"Blue Spoon Coffee Company","typeClass":"amenity","typeName":"cafe","lat":"40.71429"},{"lng":"-74.00594","distance":"0.18","name":"","typeClass":"leisure","typeName":"park","lat":"40.71114"},{"lng":"-74.00686","distance":"0.19","name":"","typeClass":"amenity","typeName":"bicycle_parking","lat":"40.71434"},{"lng":"-74.0069","distance":"0.19","name":"By Suzette","typeClass":"amenity","typeName":"fast_food","lat":"40.71434"},{"lng":"-74.00581","distance":"0.19","name":"Coffee Bean and Tea Leaf","typeClass":"amenity","typeName":"cafe","lat":"40.71448"},{"lng":"-74.00628","distance":"0.19","name":"Chipotle","typeClass":"amenity","typeName":"fast_food","lat":"40.7145"},{"lng":"-74.00476","distance":"0.19","name":"","typeClass":"amenity","typeName":"bicycle_parking","lat":"40.71424"},{"lng":"-74.00672","distance":"0.19","name":"","typeClass":"amenity","typeName":"bicycle_parking","lat":"40.71444"},{"lng":"-74.00563","distance":"0.19","name":"Citi Bike - Reade St & Broadway","typeClass":"amenity","typeName":"bicycle_rental","lat":"40.7145"},{"lng":"-74.00651","distance":"0.19","name":"Dunkin' Donuts","typeClass":"amenity","typeName":"cafe","lat":"40.71111"},{"lng":"-74.00687","distance":"0.2","name":"Augustine","typeClass":"amenity","typeName":"restaurant","lat":"40.71112"},{"lng":"-74.00635","distance":"0.21","name":"Un Mission Luxembourg","typeClass":"amenity","typeName":"embassy","lat":"40.71097"},{"lng":"-74.00482","distance":"0.21","name":"Pace University","typeClass":"amenity","typeName":"university","lat":"40.71117"},{"lng":"-74.00628","distance":"0.21","name":"The Beekman Pub","typeClass":"amenity","typeName":"pub","lat":"40.71091"},{"lng":"-74.0062","distance":"0.22","name":"Downtown Pharmacy","typeClass":"amenity","typeName":"pharmacy","lat":"40.71083"}]}

In [10]:
import numpy as np
num = np.nan

In [11]:
print(num)

nan

In [15]:
num is np.nan

True

In [16]:
frac= 3/6
print(frac.numerator, frac.denominator)

AttributeError: 'float' object has no attribute 'numerator'

In [21]:
def func():
    return 1,2

print(*func())

1 2

In [40]:
st = '123456'
while True:
    if int(st[-1]) % 2 == 0:
        st = st[:-1]
    else:
        print(st)
        break
# st =  list(st)
# print(*st)

12345

In [36]:
word = "hello"
chars = word.split()  # No splitting actually happens here
print(chars)

['hello']

In [65]:
import pandas as pd
my_dic = [{'id':1, 'name':'shyam', 'age':24},
          {'id':2, 'name':'vinod', 'age':27},
          {'id':3, 'name':'gagan', 'age':30}]
df = pd.DataFrame(my_dic)

In [66]:
df

   id   name  age
0   1  shyam   24
1   2  vinod   27
2   3  gagan   30

In [68]:
df[df['id'] == 2]

   id   name  age
1   2  vinod   27

In [43]:
df.set_index('id')

     name  age
id
1   shyam   24
2   vinod   27
3   gagan   30

In [44]:
df

   id   name  age
0   1  shyam   24
1   2  vinod   27
2   3  gagan   30

In [46]:
df[df['id'] == 2]

   id   name  age
1   2  vinod   27

In [51]:
df.where(df['id'] == 2)

    id   name   age
0  NaN    NaN   NaN
1  2.0  vinod  27.0
2  NaN    NaN   NaN

In [72]:
df.loc[df['id'] == 2]

   id   name  age
1   2  vinod   27

In [55]:
df

   id   name  age
0   1  shyam   24
1   2  vinod   27
2   3  gagan   30

In [73]:
df = df.where(df['id'] == 2)

In [74]:
df

    id   name   age
0  NaN    NaN   NaN
1  2.0  vinod  27.0
2  NaN    NaN   NaN

In [64]:
df[~df['name'].isnull()]

    id   name   age
1  2.0  vinod  27.0

In [75]:
df

    id   name   age
0  NaN    NaN   NaN
1  2.0  vinod  27.0
2  NaN    NaN   NaN

In [ ]:
df.dropna(inplace=True)

In [79]:
df

    id   name   age
1  2.0  vinod  27.0

In [95]:
print(*df.iloc[0][['name', 'age']])

vinod 27.0

In [97]:
df1 = df

In [98]:
df

    id   name   age
1  2.0  vinod  27.0

In [99]:
df1

    id   name   age
1  2.0  vinod  27.0

In [100]:
import pandas as pd
my_dic = [{'id':1, 'name':'shyam', 'age':24},
          {'id':2, 'name':'vinod', 'age':27},
          {'id':3, 'name':'gagan', 'age':30}]
df = pd.DataFrame(my_dic)

In [101]:
df

   id   name  age
0   1  shyam   24
1   2  vinod   27
2   3  gagan   30

In [106]:
df1 = df.copy()

In [107]:
df1

   id   name  age
0   1  shyam   24
1   2  vinod   27
2   3  gagan   30

In [ ]:
df1.iloc[0]['name'] = 'ram'

'shyam'

In [117]:
df1.iloc[0]

id          1
name    shyam
age        24
Name: 0, dtype: object

In [112]:
df1

       id   name  age
0       1  shyam   24
1       2  vinod   27
2       3  gagan   30
name  ram    ram  ram

In [123]:
def func(li):
    for i in li:
        yield i**2

li = [1,2,3,4]
temp = func(li)

In [128]:
next(temp)

StopIteration:

In [140]:
def gen():
    yield 1
    yield 2
    yield 3

temp = gen()

In [144]:
next(temp)

StopIteration:

In [135]:
temp

In [ ]:
import math
math.

2

(-0.0, -3.0)

In [155]:
abs(-3)

3

In [157]:
li = [1,2,3,4,5]
li.pop()
li.insert(0, 15)
li

[15, 1, 2, 3, 4]

In [ ]:
dts = ({'a': 1, 'b': 2}, {'c': 3, 'd': 4}, {'e': 5, 'f': 6})
dt = {'a': 1, 'b': 2}
dt.
dt

AttributeError: 'dict' object has no attribute 'add'